# BANCO DE DADOS - DEMONSTRAÇÃO
## Consultando um banco de dados usando uma função

In [16]:
import pyodbc
import mysql.connector as msql
import pandas as pd

In [17]:
# Funcao para consultar dados em um BD
def consulta_bd(conexao, consulta):
    cursor = conexao.cursor()
    cursor.execute(consulta)
    resultado = cursor.fetchall()
    resultado_df = pd.DataFrame.from_records(resultado)
    cursor.close()
    return resultado_df

In [18]:
# Consultas SQL
consulta_sql_1 = 'SELECT first_name, last_name, email FROM customer ORDER BY first_name'
consulta_sql_2 = 'SELECT title, release_year FROM film ORDER BY title;'

In [19]:
# Conexoes ODBC e Nativa
conexao_odbc = pyodbc.connect(DSN='DSN_SAKILA')
conexao_nativa = msql.connect(user='root', password='labsqlbd', database='sakila')

### Executando a funcão passando uma conexão ODBC

In [20]:
resultado_odbc = consulta_bd(conexao_odbc, consulta_sql_1)
resultado_odbc

           0         1                                  2
0      AARON     SELBY     AARON.SELBY@sakilacustomer.org
1       ADAM     GOOCH      ADAM.GOOCH@sakilacustomer.org
2     ADRIAN     CLARY    ADRIAN.CLARY@sakilacustomer.org
3      AGNES    BISHOP    AGNES.BISHOP@sakilacustomer.org
4       ALAN      KAHN       ALAN.KAHN@sakilacustomer.org
..       ...       ...                                ...
594   WILLIE   MARKHAM  WILLIE.MARKHAM@sakilacustomer.org
595    WILMA  RICHARDS  WILMA.RICHARDS@sakilacustomer.org
596  YOLANDA    WEAVER  YOLANDA.WEAVER@sakilacustomer.org
597   YVONNE   WATKINS  YVONNE.WATKINS@sakilacustomer.org
598  ZACHARY      HITE    ZACHARY.HITE@sakilacustomer.org

[599 rows x 3 columns]

### Executando a função passando uma conexão via acesso nativo

In [21]:
resultado_nativa = consulta_bd(conexao_nativa, consulta_sql_2)
resultado_nativa

                     0     1
0     ACADEMY DINOSAUR  2006
1       ACE GOLDFINGER  2006
2     ADAPTATION HOLES  2006
3     AFFAIR PREJUDICE  2006
4          AFRICAN EGG  2006
..                 ...   ...
995     YOUNG LANGUAGE  2006
996         YOUTH KICK  2006
997       ZHIVAGO CORE  2006
998  ZOOLANDER FICTION  2006
999          ZORRO ARK  2006

[1000 rows x 2 columns]

In [22]:
# Encerrando as conexões
conexao_odbc.close()
conexao_nativa.close()